Repository: abdelrahman-hamdy/ribal-new
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Ribal
ar: ريبال

# common_cancel
source: Cancel
ar: إلغاء

# common_confirm
source: Confirm
ar: تأكيد

# common_delete
source: Delete
ar: حذف

# common_edit
source: Edit
ar: تعديل

# common_save
source: Save
ar: حفظ

# common_saveChanges
source: Save Changes
ar: حفظ التغييرات

# common_close
source: Close
ar: إغلاق

# common_back
source: Back
ar: العودة

# common_retry
source: Retry
ar: إعادة المحاولة

# common_loading
source: Loading...
ar: جاري التحميل...

# common_error
source: An error occurred
ar: حدث خطأ

# common_success
source: Success
ar: نجح

# common_warning
source: Warning
ar: تحذير

# common_search
source: Search
ar: بحث

# common_filter
source: Filter
ar: تصفية

# common_no_data
source: No data available
ar: لا توجد بيانات

# common_no_results
source: No results
ar: لا توجد نتائج

# common_all
source: All
ar: الكل

# common_optional
source: Optional
ar: اختياري

# common_required
source: Required
ar: مطلوب

# common_status
source: Status
ar: الحالة

# common_date
source: Date
ar: التاريخ

# common_time
source: Time
ar: الوقت

# common_name
source: Name
ar: الاسم

# common_description
source: Description
ar: الوصف

# common_create
source: Create
ar: إنشاء

# common_add
source: Add
ar: إضافة

# common_remove
source: Remove
ar: إزالة

# common_view
source: View
ar: عرض

# common_details
source: Details
ar: التفاصيل

# common_actions
source: Actions
ar: الإجراءات

# common_members
source: Members
ar: أعضاء

# common_member
source: Member
ar: عضو

# common_total
source: Total
ar: الإجمالي

# common_info
source: Info
ar: معلومات

# common_copy
source: Copy
ar: نسخ

# common_copied
source: Copied
ar: تم النسخ

# common_yes
source: Yes
ar: نعم

# common_no
source: No
ar: لا

# common_from
source: From
ar: من

# common_to
source: To
ar: إلى

# common_at
source: at
ar: في

# common_or
source: or
ar: أو

# common_and
source: and
ar: و

# common_selectAll
source: Select All
ar: تحديد الكل

# common_unselectAll
source: Unselect All
ar: إلغاء التحديد

# common_noSelection
source: No selection
ar: لم يتم التحديد

# common_done
source: Done
ar: تم

# common_next
source: Next
ar: التالي

# common_previous
source: Previous
ar: السابق

# common_finish
source: Finish
ar: إنهاء

# common_skip
source: Skip
ar: تخطي

# common_update
source: Update
ar: تحديث

# common_refresh
source: Refresh
ar: تحديث

# common_confirmDelete
source: Confirm Delete
ar: تأكيد الحذف

# common_errorUserNotFound
source: Error: User not found
ar: المستخدم غير موجود

# profile_title
source: Profile
ar: الملف الشخصي

# profile_fullName
source: Full Name
ar: الاسم الكامل

# profile_email
source: Email
ar: البريد الإلكتروني

# profile_role
source: Role
ar: الدور

# profile_darkMode
source: Dark Mode
ar: الوضع الداكن

# profile_editProfile
source: Edit Profile
ar: تعديل الملف الشخصي

# profile_changePassword
source: Change Password
ar: تغيير كلمة المرور

# profile_logout
source: Logout
ar: تسجيل الخروج

# profile_logoutConfirm
source: Are you sure you want to logout?
ar: هل أنت متأكد من تسجيل الخروج؟

# profile_changesSaved
source: Changes saved successfully
ar: تم حفظ التغييرات بنجاح

# profile_tapToChangePhoto
source: Tap to change photo
ar: اضغط لتغيير الصورة

# profile_uploadFailed
source: Failed to upload image
ar: فشل رفع الصورة

# profile_language
source: Language
ar: اللغة

# profile_languageSubtitle
source: Choose app language
ar: اختر لغة التطبيق

# profile_saveChanges
source: Save Changes
ar: حفظ التغييرات

# language_title
source: Language
ar: اللغة

# language_arabic
source: Arabic
ar: العربية

# language_arabicSubtitle
source: Use Arabic language
ar: استخدم اللغة العربية

# theme_title
source: Dark Mode
ar: الوضع الداكن

# theme_system
source: System
ar: حسب النظام

# theme_systemSubtitle
source: Follow device settings
ar: يتبع إعدادات الجهاز

# theme_light
source: Light Mode
ar: الوضع الفاتح

# theme_lightSubtitle
source: Always light
ar: دائماً فاتح

# theme_dark
source: Dark Mode
ar: الوضع الداكن

# theme_darkSubtitle
source: Always dark
ar: دائماً داكن

# auth_login
source: Login
ar: تسجيل الدخول

# auth_loginSubtitle
source: Enter your credentials to access your account
ar: أدخل بياناتك للدخول إلى حسابك

# auth_register
source: Create Account
ar: إنشاء حساب

# auth_registerSubtitle
source: Enter your information to create a new account
ar: أدخل بياناتك لإنشاء حساب جديد

# auth_email
source: Email
ar: البريد الإلكتروني

# auth_emailHint
source: user@example.com
ar: أدخل بريدك الإلكتروني

# auth_emailRequired
source: Email is required
ar: البريد الإلكتروني مطلوب

# auth_emailInvalid
source: Invalid email address
ar: البريد الإلكتروني غير صالح

# auth_password
source: Password
ar: كلمة المرور

# auth_passwordHint
source: Min 8 characters
ar: أدخل كلمة المرور

# auth_passwordRequired
source: Password is required
ar: كلمة المرور مطلوبة

# auth_passwordMinLength
source: Password must be at least 8 characters
ar: كلمة المرور يجب أن تكون 8 أحرف على الأقل

# auth_passwordMismatch
source: Passwords do not match
ar: كلمة المرور غير متطابقة

# auth_passwordCurrent
source: Current Password
ar: كلمة المرور الحالية

# auth_passwordCurrentHint
source: Enter current password
ar: أدخل كلمة المرور الحالية

# auth_passwordCurrentRequired
source: Current password is required
ar: كلمة المرور الحالية مطلوبة

# auth_passwordNew
source: New Password
ar: كلمة المرور الجديدة

# auth_passwordNewHint
source: Min 8 characters
ar: أدخل كلمة المرور الجديدة

# auth_passwordNewRequired
source: New password is required
ar: كلمة المرور الجديدة مطلوبة

# auth_passwordConfirm
source: Confirm Password
ar: تأكيد كلمة المرور

# auth_passwordConfirmHint
source: Re-enter password
ar: أعد إدخال كلمة المرور الجديدة

# auth_passwordConfirmRequired
source: Password confirmation is required
ar: تأكيد كلمة المرور مطلوب

# auth_passwordChanged
source: Password changed successfully
ar: تم تغيير كلمة المرور بنجاح

# auth_firstName
source: First Name
ar: الاسم الأول

# auth_firstNameHint
source: John
ar: أدخل الاسم الأول

# auth_firstNameRequired
source: First name is required
ar: الاسم الأول مطلوب

# auth_lastName
source: Last Name
ar: اسم العائلة

# auth_lastNameHint
source: Smith
ar: أدخل اسم العائلة

# auth_lastNameRequired
source: Last name is required
ar: اسم العائلة مطلوب

# auth_invitationCode
source: Invitation Code
ar: كود الدعوة

# auth_invitationCodeHint
source: ABC-123
ar: أدخل كود الدعوة

# auth_invitationCodeRequired
source: Invitation code is required
ar: كود الدعوة مطلوب

# auth_haveAccount
source: Already have an account?
ar: لديك حساب بالفعل؟

# auth_noAccount
source: Don't have an account?
ar: ليس لديك حساب؟

# auth_verifyEmail
source: Verify Email
ar: التحقق من البريد الإلكتروني

# auth_verifyEmailSent
source: We sent a verification email to
ar: أرسلنا رسالة تحقق إلى

# auth_verifyEmailCheck
source: Check your email
ar: تحقق من بريدك الإلكتروني

# auth_verifyEmailMessage
source: Please click the link in the email to verify your account
ar: يرجى النقر على الرابط في الرسالة للتحقق من حسابك

# auth_verifyEmailWaiting
source: Waiting for verification...
ar: في انتظار التحقق...

# auth_verifyEmailResend
source: Resend email
ar: إعادة إرسال الرسالة

# auth_verifyEmailResendCooldown
source: Resend in
ar: إعادة الإرسال بعد

# auth_verifyEmailSeconds
source: seconds
ar: ثانية

# auth_verifyEmailBack
source: Back to login
ar: العودة لتسجيل الدخول

# auth_forgotPassword
source: Forgot password?
ar: نسيت كلمة المرور؟

# nav_home
source: Home
ar: الرئيسية

# nav_tasks
source: Tasks
ar: المهام

# nav_myTasks
source: My Tasks
ar: مهامي

# nav_teamTasks
source: Team Tasks
ar: مهام الفريق

# nav_controlPanel
source: Control Panel
ar: لوحة التحكم

# nav_profile
source: Profile
ar: الملف الشخصي

# nav_notifications
source: Notifications
ar: الإشعارات

# nav_statistics
source: Statistics
ar: الإحصائيات

# nav_settings
source: Settings
ar: الإعدادات

source: Task Title
ar: عنوان المهمة

# task_titleHint
source: Enter task title
ar: أدخل عنوان المهمة

# task_titleRequired
source: Task title is required
ar: عنوان المهمة مطلوب

source: Task Description
ar: وصف المهمة

# task_descriptionHint
source: Enter task description (optional)
ar: أدخل وصف المهمة (اختياري)

source: Task Description (optional)
ar: وصف المهمة (اختياري)

# task_create
source: Create Task
ar: إنشاء مهمة

# task_createNew
source: New Task
ar: مهمة جديدة

# task_edit
source: Edit Task
ar: تعديل المهمة

# task_delete
source: Delete Task
ar: حذف المهمة

# task_deleteConfirm
source: Are you sure you want to delete this task? This action cannot be undone.
ar: هل أنت متأكد من حذف هذه المهمة؟ لا يمكن التراجع عن هذا الإجراء.

source: Task Details
ar: تفاصيل المهمة

# task_manage
source: Manage Tasks
ar: إدارة المهام

# task_publish
source: Publish Task
ar: نشر المهمة

# task_publishToday
source: Publish for today only
ar: نشر لليوم فقط

# task_publishRecurring
source: Publish as recurring task
ar: نشر كمهمة متكررة

# task_archive
source: Archive Task
ar: أرشفة المهمة

# task_unarchive
source: Unarchive
ar: إلغاء الأرشفة

# task_stopRecurring
source: Stop Recurring Task
ar: إيقاف المهمة المتكررة

# task_stopRecurringConfirm
source: This task will be archived and will not be published to employees until you reactivate it from the archive section.
ar: سيتم أرشفة هذه المهمة ولن يتم نشرها للموظفين حتى تقوم بإعادة تفعيلها من لوحة التحكم في قسم الأرشيف.

# task_stopArchive
source: Stop and Archive
ar: إيقاف وأرشفة

# task_createdSuccess
source: Task created successfully
ar: تم إنشاء المهمة بنجاح

# task_updatedSuccess
source: Task updated successfully
ar: تم تحديث المهمة بنجاح

# task_deletedSuccess
source: Task deleted successfully
ar: تم حذف المهمة بنجاح

# task_archivedSuccess
source: Task archived successfully
ar: تم أرشفة المهمة بنجاح

# task_publishedSuccess
source: Task published successfully
ar: تم نشر المهمة بنجاح

# task_loadError
source: Failed to load task
ar: فشل في تحميل المهمة

# task_noTasks
source: No tasks
ar: لا توجد مهام

# task_noTasksToday
source: No tasks today
ar: لا توجد مهام اليوم

# task_noTasksTodaySubtitle
source: No tasks assigned for today
ar: لم يتم تعيين أي مهام لهذا اليوم

# task_noTasksAssigned
source: No tasks assigned to you
ar: لم يتم تعيين أي مهام لك

# task_today
source: Today's Tasks
ar: مهام اليوم

# task_todayTasks
source: Your tasks for today
ar: مهامك لهذا اليوم

# task_progress
source: Completion Rate
ar: معدل الإنجاز

# task_completed
source: Completed
ar: مكتملة

# task_pending
source: Pending
ar: قيد الانتظار

# task_overdue
source: Overdue
ar: متأخرة

# task_statusDone
source: Done
ar: مكتمل

# task_statusPending
source: Pending
ar: قيد الانتظار

# task_statusOverdue
source: Overdue
ar: متأخر

# task_statusApologized
source: Apologized
ar: معتذر

# task_statusActive
source: Active
ar: نشطة

# task_statusArchived
source: Archived
ar: مؤرشفة

# task_loading
source: Loading task...
ar: جاري تحميل المهمة...

# task_recurring
source: Recurring Task
ar: مهمة متكررة

# task_recurringLabel
source: Reschedule task daily
ar: إعادة جدولة المهمة يومياً

# task_once
source: One-time
ar: لمرة واحدة

# task_attachmentRequired
source: Attachment Required
ar: المرفق مطلوب

# task_attachmentRequiredSubtitle
source: Assignees must attach a file when completing the task
ar: يجب على المكلفين إرفاق ملف عند إتمام المهمة

# task_attachmentUpload
source: Upload Attachment
ar: رفع مرفق

# task_attachmentUploaded
source: File uploaded successfully
ar: تم رفع الملف بنجاح

# task_attachmentUploadError
source: Failed to upload file
ar: فشل في رفع الملف

# task_attachmentMustUpload
source: Must upload attachment first
ar: يجب رفع المرفق أولاً

# task_attachmentView
source: View Attachment
ar: عرض المرفق

# task_deadline
source: Deadline
ar: موعد التسليم

# task_deadlineAt
source: Deadline:
ar: موعد التسليم:

# task_deadlineExpired
source: Expired
ar: منتهي

# task_labels
source: Labels
ar: التصنيفات

# task_noLabels
source: No labels
ar: بدون تصنيفات

# task_selectLabels
source: Select Labels
ar: اختر التصنيفات

# task_assignees
source: Assignees
ar: المكلفين

# task_assigneeAll
source: All Employees
ar: جميع الموظفين

# task_assigneeGroups
source: Specific Groups
ar: مجموعات محددة

# task_assigneeCustom
source: Specific Users
ar: مستخدمين محددين

# task_assigneeSelect
source: Select Assignees
ar: اختر المكلفين

# task_assigneeSelectGroups
source: Select Groups
ar: اختر المجموعات

# task_noAssignees
source: No assignees assigned
ar: لم يتم تعيين مكلفين

# task_createdBy
source: Created by
ar: أنشئت بواسطة

# task_createdAt
source: Created at
ar: تاريخ الإنشاء

source: Task Type
ar: نوع المهمة

# task_typeOnce
source: One-time
ar: لمرة واحدة

# task_typeRecurring
source: Recurring
ar: متكررة

source: Task Info
ar: معلومات المهمة

# task_assigneeInfo
source: Assignment Info
ar: معلومات التكليف

# task_progressInfo
source: Progress Info
ar: معلومات الإنجاز

# task_selectAtLeastOneGroup
source: Please select at least one group
ar: يرجى اختيار مجموعة واحدة على الأقل

# task_assignTo
source: Assign task to
ar: تعيين المهمة إلى

# task_selectGroups
source: Select groups:
ar: اختر المجموعات:

# task_allUsers
source: All Users
ar: جميع المستخدمين

# task_allUsersSubtitle
source: Task will be assigned to all employees
ar: سيتم تعيين المهمة لجميع الموظفين

# task_specificGroups
source: Specific Groups
ar: مجموعات محددة

# task_specificGroupsSubtitle
source: Choose groups that will receive the task
ar: اختر المجموعات التي ستتلقى المهمة

# task_archivedTask
source: Archived Task
ar: مهمة مؤرشفة

# task_activeTask
source: Active Task
ar: مهمة نشطة

# task_recurringPaused
source: Recurring task is paused
ar: المهمة المتكررة متوقفة مؤقتاً

# task_noLabelsAvailable
source: No labels available. You can create labels from the control panel.
ar: لا توجد تصنيفات متاحة. يمكنك إنشاء تصنيفات من لوحة التحكم.

# task_noGroupsAvailable
source: No groups available. Create groups from the control panel first.
ar: لا توجد مجموعات متاحة. قم بإنشاء مجموعات من لوحة التحكم أولاً.

# assignment_title
source: Assignment
ar: التكليف

source: Assignment Details
ar: تفاصيل التكليف

# assignment_complete
source: Submit Task
ar: تسليم المهمة

# assignment_completeConfirm
source: Are you sure you want to submit this task?
ar: هل أنت متأكد من تسليم هذه المهمة؟

# assignment_submit
source: Submit
ar: تسليم

# assignment_submitted
source: Submitted
ar: تم التسليم

# assignment_submittedSuccess
source: Task submitted successfully
ar: تم تسليم المهمة بنجاح

# assignment_apologize
source: Apologize for Task
ar: الاعتذار عن المهمة

# assignment_apologizeMessage
source: Please enter reason for apology (optional):
ar: يرجى إدخال سبب الاعتذار (اختياري):

# assignment_apologizeReason
source: Apology Reason
ar: سبب الاعتذار

# assignment_apologizeConfirm
source: Apologize
ar: اعتذار

# assignment_apologized
source: Apologized
ar: تم الاعتذار

# assignment_apologizedSuccess
source: Apology submitted successfully
ar: تم الاعتذار عن المهمة بنجاح

# assignment_reactivate
source: Reactivate
ar: إعادة تفعيل

# assignment_reactivateConfirm
source: Are you sure you want to reactivate this assignment?
ar: هل أنت متأكد من إعادة تفعيل هذا التكليف؟

# assignment_reactivated
source: Reactivated
ar: تمت إعادة التفعيل

# assignment_statusPending
source: Pending
ar: قيد الانتظار

# assignment_statusCompleted
source: Completed
ar: مكتملة

# assignment_statusApologized
source: Apologized
ar: معتذر

# assignment_statusOverdue
source: Overdue
ar: متأخر

# assignment_noAssignments
source: No assignments
ar: لا توجد تكليفات

# assignment_myAssignments
source: My Assignments
ar: تكليفاتي

# assignment_completedAt
source: Completed at
ar: تم التسليم في

# assignment_apologizedAt
source: Apologized at
ar: تم الاعتذار في

# assignment_loadError
source: Failed to load assignment
ar: فشل في تحميل التكليف

# assignment_hasAttachment
source: Has attachment
ar: يوجد مرفق

# assignment_viewAttachment
source: View Submitted Attachment
ar: عرض المرفق المُسلّم

# group_title
source: Groups
ar: المجموعات

source: Group Name
ar: اسم المجموعة

# group_nameHint
source: Enter group name
ar: أدخل اسم المجموعة

# group_nameRequired
source: Group name is required
ar: اسم المجموعة مطلوب

# group_create
source: Create Group
ar: إنشاء مجموعة

# group_createNew
source: New Group
ar: مجموعة جديدة

# group_edit
source: Edit Group
ar: تعديل المجموعة

# group_delete
source: Delete Group
ar: حذف المجموعة

# group_deleteConfirm
source: Are you sure you want to delete group
ar: هل أنت متأكد من حذف المجموعة

# group_deleteMembers
source: {count} member(s) will be removed from this group
ar: سيتم إزالة {count} عضو من هذه المجموعة

# group_manage
source: Manage Groups
ar: إدارة المجموعات

# group_manageSubtitle
source: Manage employee groups
ar: إدارة مجموعات الموظفين

# group_manageMembers
source: Manage Members
ar: إدارة الأعضاء

# group_noGroups
source: No groups
ar: لا توجد مجموعات

# group_noGroupsSubtitle
source: Create groups to organize employees
ar: قم بإنشاء مجموعات لتنظيم الموظفين

# group_noMembers
source: No members in this group
ar: لا يوجد أعضاء في هذه المجموعة

# group_addMembers
source: Add Members
ar: إضافة أعضاء

# group_showMembers
source: Members
ar: الأعضاء

# group_showAvailable
source: Available
ar: المتاحين

# group_totalMembers
source: Total Members
ar: إجمالي الأعضاء

# group_createdSuccess
source: Group created successfully
ar: تم إنشاء المجموعة بنجاح

# group_updatedSuccess
source: Group updated successfully
ar: تم تحديث المجموعة بنجاح

# group_deletedSuccess
source: Group deleted successfully
ar: تم حذف المجموعة بنجاح

# group_loadError
source: Failed to load groups
ar: فشل في تحميل المجموعات

# group_searchHint
source: Search groups...
ar: البحث عن مجموعات...

# group_noGroupsMatchingSearch
source: No group found matching "{query}"
ar: لم يتم العثور على مجموعة تطابق "{query}"

# group_membersOf
source: Manage "{name}" members
ar: أعضاء {name}

# group_searchUsers
source: Search for user...
ar: البحث عن مستخدمين...

# group_noUsersAvailable
source: No users available
ar: لا يوجد مستخدمين متاحين

# group_removeFromGroup
source: Remove from group
ar: إزالة من المجموعة

# group_addToGroup
source: Add to group
ar: إضافة للمجموعة

# group_nameTooShort
source: Group name is too short
ar: اسم المجموعة قصير جداً

# group_preview
source: Preview:
ar: معاينة

# label_title
source: Labels
ar: التصنيفات

source: Label Name
ar: اسم التصنيف

# label_nameHint
source: Enter label name
ar: أدخل اسم التصنيف

# label_nameRequired
source: Label name is required
ar: اسم التصنيف مطلوب

source: Label Color
ar: لون التصنيف

# label_create
source: Create Label
ar: إنشاء تصنيف

# label_createNew
source: New Label
ar: تصنيف جديد

# label_edit
source: Edit Label
ar: تعديل التصنيف

# label_delete
source: Delete Label
ar: حذف التصنيف

# label_manage
source: Manage Labels
ar: إدارة التصنيفات

# label_manageSubtitle
source: Create labels to organize tasks
ar: إنشاء تصنيفات لتنظيم المهام

# label_noLabels
source: No labels
ar: لا توجد تصنيفات

# label_noLabelsSubtitle
source: Create labels to organize tasks
ar: قم بإنشاء تصنيفات لتنظيم المهام

# label_deleteConfirm
source: Are you sure you want to delete label
ar: هل أنت متأكد من حذف التصنيف

# label_createdSuccess
source: Label created successfully
ar: تم إنشاء التصنيف بنجاح

# label_updatedSuccess
source: Label updated successfully
ar: تم تحديث التصنيف بنجاح

# label_deletedSuccess
source: Label deleted successfully
ar: تم حذف التصنيف بنجاح

# label_loadError
source: Failed to load labels
ar: فشل في تحميل التصنيفات

# label_searchHint
source: Search labels...
ar: البحث عن تصنيفات...

# label_noLabelsMatchingSearch
source: No label found matching "{query}"
ar: لم يتم العثور على تصنيف يطابق "{query}"

# label_nameTooShort
source: Label name is too short
ar: اسم التصنيف قصير جداً

# label_saveChanges
source: Save Changes
ar: حفظ التغييرات

# label_createLabel
source: Create Label
ar: إنشاء تصنيف

# label_deleteConfirmMessage
source: Are you sure you want to delete the label "{name}"?
ar: هل أنت متأكد من حذف التصنيف "{name}"؟

# label_disabled
source: Disabled
ar: معطل

# label_deactivate
source: Deactivate
ar: تعطيل

# label_activate
source: Activate
ar: تفعيل

# label_preview
source: Preview:
ar: معاينة

# whitelist_title
source: Whitelist
ar: القائمة البيضاء

# whitelist_subtitle
source: Manage approved emails
ar: إدارة البريد الإلكتروني المعتمد

# whitelist_description
source: Add approved email addresses for direct registration
ar: أضف عناوين البريد الإلكتروني المعتمدة للتسجيل المباشر

# whitelist_addEmail
source: Add to Whitelist
ar: إضافة إلى القائمة البيضاء

# whitelist_emailHint
source: Enter email address
ar: أدخل البريد الإلكتروني

# whitelist_emailCopied
source: Email copied
ar: تم نسخ البريد الإلكتروني

# whitelist_deleteConfirm
source: Are you sure you want to delete
ar: هل أنت متأكد من حذف

# whitelist_deleteConfirmText
source: from whitelist?
ar: من القائمة البيضاء؟

# whitelist_noEmails
source: No email addresses
ar: لا توجد عناوين بريد إلكتروني

# whitelist_addedSuccess
source: Added to whitelist successfully
ar: تمت الإضافة إلى القائمة البيضاء بنجاح

# whitelist_deletedSuccess
source: Deleted from whitelist successfully
ar: تم الحذف من القائمة البيضاء بنجاح

# whitelist_loadError
source: Failed to load whitelist
ar: فشل في تحميل القائمة البيضاء

# whitelist_searchHint
source: Search by email...
ar: البحث بالبريد الإلكتروني...

# whitelist_noEntries
source: No entries
ar: لا توجد عناوين بريد إلكتروني

# whitelist_noEntriesSubtitle
source: Add email addresses to allow direct registration
ar: أضف عناوين بريد إلكتروني للسماح بالتسجيل المباشر

# whitelist_noEntriesMatchingSearch
source: No email found matching "{query}"
ar: لم يتم العثور على بريد إلكتروني يطابق "{query}"

# whitelist_emailLabel
source: Email Address
ar: البريد الإلكتروني

# whitelist_emailRequired
source: Email is required
ar: البريد الإلكتروني مطلوب

# whitelist_emailInvalid
source: Invalid email address
ar: البريد الإلكتروني غير صالح

# whitelist_role
source: Role
ar: الدور

# whitelist_roleAdminDesc
source: Full system management permissions
ar: وصول كامل لإدارة النظام

# whitelist_roleManagerDesc
source: Manage tasks and assigned employees
ar: يمكنه إنشاء المهام وإدارة الفريق

# whitelist_roleEmployeeDesc
source: Execute assigned tasks
ar: يمكنه تنفيذ المهام الموكلة إليه

# whitelist_addTitle
source: Add to Whitelist
ar: إضافة إلى القائمة البيضاء

# whitelist_deleteConfirmMessage
source: Are you sure you want to remove "{email}" from the whitelist?
ar: هل أنت متأكد من إزالة "{email}" من القائمة البيضاء؟

# invitation_title
source: Invitation Codes
ar: أكواد الدعوة

# invitation_subtitle
source: Create and manage invitation codes
ar: إنشاء وإدارة أكواد الدعوة

# invitation_create
source: Create Invitation Code
ar: إنشاء كود دعوة

# invitation_createDescription
source: Create invitation codes for new users
ar: قم بإنشاء أكواد دعوة للمستخدمين الجدد

# invitation_statusUsed
source: Used
ar: مستخدم

# invitation_statusAvailable
source: Available
ar: متاح

# invitation_copyCode
source: Copy Code
ar: نسخ الكود

# invitation_codeCopied
source: Code copied
ar: تم نسخ الكود

# invitation_delete
source: Delete Code
ar: حذف الكود

# invitation_deleteConfirm
source: Are you sure you want to delete invitation code
ar: هل أنت متأكد من حذف كود الدعوة

# invitation_noCodes
source: No codes
ar: لا توجد أكواد

# invitation_noCodesSubtitle
source: Create invitation codes for new users
ar: لم يتم إنشاء أي أكواد دعوة بعد

# invitation_noCodesAvailable
source: No available codes
ar: لا توجد أكواد متاحة

# invitation_noCodesUsed
source: No used codes
ar: لا توجد أكواد مستخدمة

# invitation_usedBy
source: Used by
ar: مستخدم بواسطة

# invitation_createdSuccess
source: Invitation code created successfully
ar: تم إنشاء كود الدعوة بنجاح

# invitation_deletedSuccess
source: Invitation code deleted successfully
ar: تم حذف كود الدعوة بنجاح

# invitation_loadError
source: Failed to load invitation codes
ar: فشل في تحميل أكواد الدعوة
