Repository: abdelrahman-hamdy/ribal-new
Catalog: lib/l10n/app_*.arb
Languages: ar

# invitation_tabAvailable
source: Available
ar: متاحة

# invitation_tabUsed
source: Used
ar: مستخدمة

# invitation_role
source: Role
ar: الدور

# invitation_createCodeSubtitle
source: A unique code will be created that can be used once for registration
ar: سيتم إنشاء كود فريد لدعوة مستخدم جديد

# invitation_createCode
source: Create Code
ar: إنشاء الكود

# invitation_successTitle
source: Code created successfully!
ar: تم إنشاء الكود بنجاح

# invitation_invitationCode
source: Invitation Code
ar: كود الدعوة

# invitation_roleLabel
source: Role: {role}
ar: الدور: {role}

# invitation_copyCodeButton
source: Copy Code
ar: نسخ الكود

# invitation_usedOn
source: Used on {date}
ar: استخدم في {date}

# invitation_noCodesAvailableSubtitle
source: All codes have been used, create new codes
ar: تم استخدام جميع الأكواد، قم بإنشاء أكواد جديدة

# invitation_noCodesUsedSubtitle
source: No invitation code has been used yet
ar: لم يتم استخدام أي كود دعوة بعد

# invitation_deleteConfirmMessage
source: Are you sure you want to delete invitation code "{code}"?
ar: هل أنت متأكد من حذف كود الدعوة "{code}"؟

# user_title
source: Users
ar: المستخدمين

# user_subtitle
source: Manage user accounts and roles
ar: إدارة حسابات المستخدمين والأدوار

# user_manage
source: Manage Users
ar: إدارة المستخدمين

# user_manageActions
source: Admin Actions
ar: إجراءات المسؤول

# user_welcome
source: Hello,
ar: مرحباً،

# user_welcomeName
source: Hello, {name}
ar: مرحباً، {name}

# user_noUsers
source: No users
ar: لا يوجد مستخدمين

# user_noUsersSubtitle
source: No users registered yet
ar: لم يتم تسجيل أي مستخدمين بعد

# user_noUsersAvailable
source: No users available
ar: لا يوجد مستخدمين متاحين

# user_noUsersInRole
source: No users with role {role}
ar: لا يوجد مستخدمين بدور {role}

# user_loadError
source: Failed to load users
ar: فشل في تحميل المستخدمين

source: User Details
ar: تفاصيل المستخدم

# user_profile
source: Profile
ar: الملف الشخصي

# user_unknown
source: Unknown User
ar: مستخدم غير معروف

# user_roleAdmin
source: Admin
ar: مدير النظام

# user_roleSupervisor
source: Supervisor
ar: مشرف

# user_roleManager
source: Manager
ar: مدير

# user_roleEmployee
source: Employee
ar: موظف

# user_roleAdmins
source: Admins
ar: مدراء النظام

# user_roleSupervisors
source: Supervisors
ar: المشرفين

# user_roleManagers
source: Managers
ar: المدراء

# user_roleEmployees
source: Employees
ar: الموظفين

# user_changeRole
source: Change Role
ar: تغيير الدور

# user_changeRoleConfirm
source: Do you want to change {user}'s role to {role}?
ar: هل تريد تغيير دور {user} إلى {role}؟

# user_roleChanged
source: Role changed successfully
ar: تم تغيير الدور بنجاح

# user_roleChangeError
source: Failed to change role
ar: فشل في تغيير الدور

# user_cannotChangeAdmin
source: Cannot change admin role
ar: لا يمكن تغيير دور مدير النظام

# user_manageGroups
source: Manage Groups
ar: إدارة المجموعات

# user_managedGroups
source: Managed Groups
ar: المجموعات المُدارة

# user_managedGroupsCount
source: {count} group(s)
ar: {count} مجموعة

# user_noManagedGroups
source: No groups assigned yet
ar: لم يتم تعيين مجموعات بعد

# user_canAssignAll
source: Can assign to all employees
ar: يمكنه التعيين لجميع الموظفين

# user_allowAssignAll
source: Allow assignment to all employees
ar: السماح بالتعيين لجميع الموظفين

# notification_title
source: Notifications
ar: الإشعارات

# notification_noNotifications
source: No notifications
ar: لا توجد إشعارات

# notification_noNotificationsSubtitle
source: New notifications will appear here
ar: ستظهر الإشعارات الجديدة هنا

# notification_markAllRead
source: Mark all as read
ar: قراءة الكل

# notification_markRead
source: Mark as read
ar: تحديد كمقروء

# notification_delete
source: Delete
ar: حذف

# notification_deleteAll
source: Delete all
ar: حذف الكل

# notification_loadError
source: Failed to load notifications
ar: فشل في تحميل الإشعارات

# notification_deleteError
source: Failed to delete notification
ar: فشل في حذف الإشعار

# archive_title
source: Archive
ar: الأرشيف

# archive_subtitle
source: Archived tasks
ar: المهام المؤرشفة

# archive_noArchived
source: No archived tasks
ar: لا توجد مهام مؤرشفة

# archive_noArchivedSubtitle
source: Archived tasks will appear here
ar: ستظهر المهام المؤرشفة هنا

# archive_restore
source: Restore
ar: استعادة

# archive_restoreConfirm
source: Do you want to restore this task?
ar: هل تريد استعادة هذه المهمة؟

# archive_restoredSuccess
source: Task restored successfully
ar: تمت استعادة المهمة بنجاح

# archive_empty
source: Archive is empty
ar: الأرشيف فارغ

# archive_publishTask
source: Publish Task
ar: نشر المهمة

# archive_publishForToday
source: Publish for today only
ar: نشر لليوم فقط

# archive_publishForTodaySubtitle
source: Task will be published for employees today only
ar: سيتم نشر المهمة للموظفين لليوم فقط

# archive_deadlineExpired
source: Deadline expired for today's tasks ({time})
ar: انتهى الموعد النهائي لمهام اليوم ({time})

# archive_publishAsRecurring
source: Publish as recurring task
ar: نشر كمهمة متكررة

# archive_publishAsRecurringSubtitle
source: Task will be published daily for employees
ar: سيتم نشر المهمة يومياً للموظفين

# archive_wasRecurring
source: Was recurring
ar: كانت متكررة

# archive_wasOneTime
source: Was one-time
ar: كانت لمرة واحدة

# archive_timeExpired
source: Time expired
ar: انتهى الوقت

# archive_publishConfirmTitle
source: Publish for today only
ar: نشر لليوم فقط

# archive_publishConfirmMessage
source: This task will be published for employees for today only and will not repeat.
ar: سيتم نشر هذه المهمة للموظفين لليوم فقط ولن تتكرر.

# archive_publishRecurringConfirmTitle
source: Publish as recurring task
ar: نشر كمهمة متكررة

# archive_publishRecurringConfirmMessage
source: This task will be published daily for employees. You can stop it later from task details.
ar: سيتم نشر هذه المهمة يومياً للموظفين. يمكنك إيقافها لاحقاً من تفاصيل المهمة.

# common_publish
source: Publish
ar: نشر

# settings_title
source: Settings
ar: الإعدادات

# settings_general
source: General Settings
ar: الإعدادات العامة

# settings_subtitle
source: Recurring tasks time and deadlines
ar: وقت المهام المتكررة والمواعيد النهائية

# settings_recurringTime
source: Recurring Tasks Time
ar: وقت المهام المتكررة

# settings_recurringTimeSubtitle
source: Time when recurring tasks are scheduled daily
ar: الوقت الذي يتم فيه جدولة المهام المتكررة يومياً

# settings_recurringTimeSelect
source: Select recurring tasks time
ar: اختر وقت المهام المتكررة

# settings_deadlineTime
source: Tasks Deadline
ar: الموعد النهائي للمهام

# settings_deadlineTimeSubtitle
source: Time when tasks expire daily
ar: الوقت الذي تنتهي فيه المهام يومياً

# settings_deadlineTimeSelect
source: Select tasks deadline time
ar: اختر الموعد النهائي للمهام

# settings_dailyWindow
source: Daily Tasks Window
ar: نافذة المهام اليومية

# settings_loadError
source: Failed to load settings
ar: فشل في تحميل الإعدادات

# settings_saveError
source: Failed to save settings
ar: فشل في حفظ الإعدادات

# settings_savedSuccess
source: Settings saved successfully
ar: تم حفظ الإعدادات بنجاح

# settings_confirmChange
source: Confirm Change
ar: تأكيد التغيير

# settings_changeRecurringTime
source: Do you want to change recurring tasks time to {time}?
ar: هل تريد تغيير وقت المهام المتكررة إلى {time}؟

# settings_changeDeadlineTime
source: Do you want to change tasks deadline to {time}?
ar: هل تريد تغيير الموعد النهائي للمهام إلى {time}؟

# controlPanel_title
source: Control Panel
ar: لوحة التحكم

# controlPanel_userManagement
source: User Management
ar: إدارة المستخدمين

# controlPanel_taskManagement
source: Task Management
ar: إدارة المهام

# controlPanel_registration
source: Registration & Invitations
ar: التسجيل والدعوات

# controlPanel_settings
source: Settings
ar: الإعدادات

# admin_home
source: Home
ar: الرئيسية

# admin_statistics
source: Statistics
ar: الإحصائيات

# admin_tasks
source: Tasks
ar: المهام

# statistics_title
source: Statistics
ar: الإحصائيات

# statistics_loading
source: Loading statistics...
ar: جاري تحميل الإحصائيات...

# statistics_overview
source: Tasks Overview
ar: نظرة عامة على المهام

# statistics_totalTasks
source: Total Tasks
ar: إجمالي المهام

# statistics_completed
source: Completed
ar: المكتملة

# statistics_inProgress
source: Pending
ar: قيد الانتظار

# statistics_apologized
source: Apologized
ar: معتذر عنها

# statistics_thisWeek
source: This Week
ar: هذا الأسبوع

# statistics_thisMonth
source: This Month
ar: هذا الشهر

# statistics_bestEmployees
source: Best Employees
ar: أفضل الموظفين

# statistics_completionRate
source: Completion Rate
ar: معدل الإنجاز

# statistics_apologyRate
source: Apology Rate
ar: معدل الاعتذار

# statistics_noData
source: No data recorded in this period
ar: لم يتم تسجيل أي بيانات في هذه الفترة

# statistics_noUsers
source: No users registered in this period
ar: لم يتم تسجيل أي مستخدمين في هذه الفترة

# statistics_noTasks
source: No tasks recorded in this period
ar: لم يتم تسجيل أي مهام في هذه الفترة

# statistics_total
source: Total
ar: الإجمالي

# statistics_supervisors
source: Supervisors
ar: مشرفين

# statistics_managers
source: Managers
ar: مدراء

# statistics_employees
source: Employees
ar: موظفين

# statistics_performanceRates
source: Performance Rates
ar: معدلات الأداء

# statistics_taskStatistics
source: Task Statistics
ar: إحصائيات المهام

# statistics_tasks
source: tasks
ar: مهمة

# notes_title
source: Notes
ar: الملاحظات

# notes_noNotes
source: No notes yet
ar: لا توجد ملاحظات بعد

# notes_addButton
source: Add Note
ar: إضافة ملاحظة

# notes_newNote
source: New Note
ar: ملاحظة جديدة

# notes_noteHint
source: Write your note here...
ar: اكتب ملاحظتك هنا...

# notes_count
source: {count} note(s)
ar: {count} ملاحظة

# notes_addedSuccess
source: Note added successfully
ar: تمت إضافة الملاحظة بنجاح

# notes_deletedSuccess
source: Note deleted successfully
ar: تم حذف الملاحظة بنجاح

# error_generic
source: An error occurred
ar: حدث خطأ

# error_retry
source: Retry
ar: إعادة المحاولة

# error_permissionDenied
source: You don't have permission to access this data.
ar: ليس لديك صلاحية للوصول إلى هذه البيانات.

# error_userNotFound
source: User data not found
ar: لم يتم العثور على بيانات المستخدم

# error_taskNotFound
source: Task not found
ar: لم يتم العثور على المهمة

# error_assignmentNotFound
source: Assignment not found
ar: لم يتم العثور على التكليف

# error_noInternet
source: No internet connection. Please check your connection and try again.
ar: لا يوجد اتصال بالإنترنت. يرجى التحقق من الاتصال والمحاولة مرة أخرى.

# error_fileOpen
source: Could not open file
ar: لم يتمكن من فتح الملف

# error_uploadFile
source: Failed to upload file
ar: فشل في رفع الملف

# error_loadData
source: Failed to load data
ar: فشل في تحميل البيانات

# error_saveData
source: Failed to save data
ar: فشل في حفظ البيانات

# error_unknown
source: An unknown error occurred
ar: حدث خطأ غير معروف

# date_today
source: Today
ar: اليوم

# date_yesterday
source: Yesterday
ar: أمس

# date_tomorrow
source: Tomorrow
ar: غداً

# date_thisWeek
source: This Week
ar: هذا الأسبوع

# date_thisMonth
source: This Month
ar: هذا الشهر

# date_lastWeek
source: Last Week
ar: الأسبوع الماضي

# date_lastMonth
source: Last Month
ar: الشهر الماضي

# time_am
source: AM
ar: صباحاً

# time_pm
source: PM
ar: مساءً

# time_ago
source: ago
ar: منذ

# time_remaining
source: remaining
ar: متبقي

# color_red
source: Red
ar: أحمر

# color_blue
source: Blue
ar: أزرق

# color_green
source: Green
ar: أخضر

# color_yellow
source: Yellow
ar: أصفر

# color_purple
source: Purple
ar: أرجواني

# color_pink
source: Pink
ar: وردي

# color_cyan
source: Cyan
ar: سماوي

# color_amber
source: Amber
ar: كهرماني

# color_lime
source: Lime
ar: ليموني

# color_indigo
source: Indigo
ar: نيلي

# color_teal
source: Teal
ar: فيروزي

# color_orange
source: Orange
ar: برتقالي

# color_emerald
source: Emerald
ar: زمردي

# color_sky
source: Sky Blue
ar: سماوي فاتح

# color_violet
source: Violet
ar: بنفسجي

# color_fuchsia
source: Fuchsia
ar: فوشي

# color_rose
source: Rose
ar: وردي فاتح

# color_stone
source: Stone
ar: رمادي حجري

# common_pickFromGallery
source: Pick from gallery
ar: اختر من المعرض

# common_takePhoto
source: Take photo
ar: التقط صورة

# common_selectFile
source: Select file
ar: اختر ملف

# common_uploading
source: Uploading...
ar: جاري الرفع...

# common_of
source: of
ar: من

# common_unknown
source: Unknown
ar: غير معروف

# task_loading_message
source: Loading task...
ar: جاري تحميل المهمة...

# task_noAssignments
source: No assignments
ar: لا تكليفات

# task_tasksCompleted
source: tasks completed
ar: مهمة مكتملة

# task_assigneesCompleted
source: assignees completed the task
ar: مكلف أنهوا المهمة

# task_assigneesToday
source: Today's Assignees
ar: المكلفين اليوم

# task_noAssigneesToday
source: No assignees
ar: لا يوجد مكلفين

# task_noAssigneesTodaySubtitle
source: No one has been assigned to this task today
ar: لم يتم تكليف أي شخص بهذه المهمة اليوم

# task_stop
source: Stop
ar: إيقاف

# task_attachment
source: Attachment
ar: المرفق

# task_hasAttachment
source: Has attachment
ar: يوجد مرفق

# task_noTasksAssignedToday
source: No tasks assigned to you today
ar: لم يتم تعيين أي مهام لك اليوم

# assignment_loading
source: Loading assignment...
ar: جاري تحميل المهمة...

# assignment_attachmentRequiredMessage
source: This task requires an attachment
ar: هذه المهمة تتطلب إرفاق ملف

# assignment_attachmentRequiredHint
source: Please upload an image or file before submitting
ar: يرجى رفع صورة أو ملف قبل تسليم المهمة

# assignment_submitConfirmTitle
source: Confirm Submission
ar: تأكيد التسليم

# assignment_apologizeReasonHint
source: Reason for apology...
ar: سبب الاعتذار...

# assignment_completionInfo
source: Completion Info
ar: معلومات الإكمال

# assignment_completedByAdmin
source: (Submitted by admin)
ar: (تم التسليم بواسطة الإدارة)

# assignment_byAdmin
source: (by admin)
ar: (بواسطة الإدارة)

# assignment_overdueLocked
source: Overdue - Locked
ar: متأخر - مغلق

# assignment_uploadFileFirst
source: Upload file first
ar: ارفع الملف أولاً

# assignment_fileUploadedSuccess
source: File uploaded successfully
ar: تم رفع الملف بنجاح

# assignment_fileUploadError
source: Failed to upload file. Try again.
ar: فشل في رفع الملف. حاول مرة أخرى.

# error_filePick
source: Failed to pick file
ar: فشل في اختيار الملف

# error_fileOpenError
source: Error opening file
ar: خطأ في فتح الملف

# error_fileOpenGeneric
source: An error occurred while opening the file
ar: حدث خطأ أثناء فتح الملف

# error_loadTask
source: Failed to load task
ar: فشل في تحميل المهمة

# assignment_submitTask
source: Submit Task
ar: تسليم المهمة

# assignment_submitConfirmMessage
source: Are you sure you want to submit this task?
ar: هل أنت متأكد من تسليم هذه المهمة؟

# assignment_mustUploadFirst
source: Must upload attachment first
ar: يجب رفع المرفق أولاً

# assignment_attachmentUploaded
source: Attachment uploaded
ar: تم رفع المرفق

# common_change
source: Change
ar: تغيير

# settings_recurringTimeBeforeDeadline
source: Recurring time must be before deadline
ar: وقت المهام المتكررة يجب أن يكون قبل الموعد النهائي

# settings_deadlineAfterRecurringTime
source: Deadline must be after recurring time
ar: الموعد النهائي يجب أن يكون بعد وقت المهام المتكررة

# settings_fromTo
source: From {from} to {to}
ar: من {from} إلى {to}

# settings_saving
source: Saving settings...
ar: جاري حفظ الإعدادات...

# settings_appTheme
source: App Theme
ar: مظهر التطبيق

# settings_chooseTheme
source: Choose your preferred theme
ar: اختر المظهر المفضل لديك

# user_searchHint
source: Search by name or email...
ar: البحث بالاسم أو البريد الإلكتروني...

# user_noUsersMatchingSearch
source: No users found matching "{query}"
ar: لم يتم العثور على مستخدم يطابق "{query}"

# user_loadingProfile
source: Loading profile...
ar: جاري تحميل الملف الشخصي...

source: User not found
ar: المستخدم غير موجود

# user_notFoundMessage
source: User data not found
ar: لم يتم العثور على بيانات المستخدم

# user_promoteToManager
source: Promote to Manager
ar: ترقية إلى مشرف

# user_demoteToEmployee
source: Demote to Employee
ar: تحويل إلى موظف

# user_promoteDescription
source: User will be able to create tasks and manage teams
ar: سيتمكن المستخدم من إنشاء المهام وإدارة الفرق

# user_demoteDescription
source: User will lose management permissions
ar: سيفقد المستخدم صلاحيات الإشراف

# user_changeRoleTitle
source: Confirm Role Change
ar: تأكيد تغيير الدور

# user_promoteWarning
source: User will be removed from current group and will be able to create tasks after assigning groups.
ar: سيتم إزالة المستخدم من مجموعته الحالية وسيتمكن من إنشاء المهام بعد تعيين مجموعات له.

# user_demoteWarning
source: User will lose management permissions. Tasks created by them will remain as is.
ar: سيفقد المستخدم صلاحيات الإشراف. المهام التي أنشأها ستبقى كما هي.

# user_manageGroupsFor
source: Manage {name}'s Groups
ar: إدارة مجموعات {name}

# user_assignToAllEmployees
source: Assign to all employees
ar: تعيين لجميع الموظفين

# user_assignToAllDescription
source: Allow manager to assign tasks to all employees
ar: السماح للمشرف بتعيين المهام لجميع الموظفين

# user_selectGroups
source: Select Groups
ar: اختر المجموعات

# user_noGroupsAvailable
source: No groups available
ar: لا توجد مجموعات متاحة

# user_managesGroups
source: Manages {count} group(s)
ar: يدير {count} مجموعة

# task_todayAssignments
source: Today's Tasks
ar: مهام اليوم

# stats_statistics
source: Statistics
ar: الإحصائيات

# stats_totalTasks
source: Total Tasks
ar: إجمالي المهام

# stats_completed
source: Completed
ar: المكتملة

# stats_apologized
source: Apologized
ar: معتذر عنها

# stats_completionRate
source: Completion Rate
ar: نسبة الإنجاز

# timeFilter_today
source: Today
ar: اليوم

# timeFilter_thisWeek
source: This Week
ar: هذا الأسبوع

# timeFilter_thisMonth
source: This Month
ar: هذا الشهر

# admin_adminActions
source: Admin Actions
ar: إجراءات المسؤول

# manager_cannotCreateTasks
source: You cannot create tasks
ar: لا يمكنك إنشاء مهام

# manager_noGroupsAssigned
source: No groups have been assigned to you yet. Please contact the system administrator to assign groups you can manage.
ar: لم يتم تعيين مجموعات لك بعد. يرجى التواصل مع مدير النظام لتعيين مجموعات يمكنك إدارتها.

# manager_canCreateOnlyWithGroups
source: You can only create tasks when at least one group is assigned to you, or when you are granted permission to assign to all employees.
ar: يمكنك إنشاء مهام فقط عندما يتم تعيين مجموعة واحدة على الأقل لك، أو عند منحك صلاحية التعيين لجميع الموظفين.
